In [4]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Functions

In [9]:
df["col2"].unique()#all unique values in a column

array([444, 555, 666], dtype=int64)

In [6]:
df["col2"].nunique()# number of unique values in a column

3

In [7]:
df['col2'].value_counts()#returns number of occurences f

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[df['col1']>2]#condition calls
df[df['col2']==444]
df[(df['col1']>2)&(df['col2']==444)]#combining conditions using & and |

   col1  col2 col3
3     4   444  xyz

In [10]:
def times2(x):
    return x*2
df["col1"].apply(times2)#to apply user define function
df["col2"].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [17]:
df.columns#gives you a list of column names

Index(['col1', 'col2', 'col3'], dtype='object')

In [18]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.sort_values(by="col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [20]:
df.sort_values("col2")
#sorts according to the column name provided 
#use inplace

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [21]:
df.isnull()#returns a boolean data frame

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Reading Files

## CSV files

In [23]:
pd.read_csv('example')#reading csv
df=pd.read_csv('example')#copied to a data frame

df.to_csv('my_output',index=False)#writing to a csv file
#index =false is used to eliminate automatic indexing
pd.read_csv('my_output')

"pd.read_csv('example')#reading csv\ndf=pd.read_csv('example')#copied to a data frame\n\ndf.to_csv('my_output',index=False)#writing to a csv file\n#index =false is used to eliminate automatic indexing\npd.read_csv('my_output')"

## Excel files

In [ ]:
#can only import data cannot import macros or formulas
df=pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')
#imports data as a data frame 
df.to_excel('sample2.xlsx',sheet_name='Sheet1')
#writes to xl file

## HTML files

In [ ]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
type(data)#list
#HTML files have a list of table references which is imported as a list of data frames
#cycle thorugh the list to get your desired data frame
data[0]#your data frame

## sql files

In [ ]:
#not usually preffered to use pandas to import sql
#all DBMS are different use their own drivers and libraries
from sqlalchemy import create_engine
engine=create_engine('sqlite:///:memory:')
df.to_sql('example_table',engine)
sqldf=pd.read_sql('example_table',con=engine)
sqldf